app/controllers/events_controller.rb

  def create
    @event = Event.new(# 'user_id' => User.all.sample.id,
                      'title' => params[:title],
                      'description' => params[:description],
                      'start_date' => params[:start_date],
                      'duration' => params[:duration],
                      'price' => params[:price],
                      'location' => params[:location]) # avec xxx qui sont les données obtenues à partir du formulaire
    if @event.save # essaie de sauvegarder en base @event
---
INSERT INTO "events" ("title", "description", "start_date", "duration", "price", "location", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)